import math
n = input('Δώσε πλήθος δεκαδικών ψηφίων(το πολύ 15): ')
l = '1,2,3,4,5,6,7,8,9,10,11,12,13,14,15'
l = l.split(',')
while n not in l: #Έλεγχος εισόδου
    n = input('Μη έγκυρη επιλογή. Δώσε ξανά πλήθος δεκαδικών ψηφίων(το πολύ 15):')
n=int(n)
my_pi = 3
i = 0 #1ος παράγοντας παρονομαστή
#κάθε φορά αυξάνεται κατά 2.1ος όρος σειράς ξεκινά με i=2. #Άρα counter όρων σειράς είναι i/2. 
# 1ος > 0 και εναλλάσσονται πρόσημα. Άρα πρόσημο counter-οστού όρου καθορίζεται από (-1)^(counter-1) 
while abs(math.pi-my_pi) >= 10**(-n): #αν θέλουμε ακρίβεια n ψηψίων στο κλασμ. μέρος  >= 10**(-n-1)
    i += 2
    counter = i/2
    paronomastis = i*(i+1)*(i+2)
    my_pi += (-1)**(counter-1)*4/paronomastis
print('\n Για να υπολογίσουμε σωστά τα πρώτα', n ,'ψηφία του π, θα χρειαστεί να προσθέσουμε', int(counter),'όρους. \n')   
print('Η κανονική τιμή του π είναι: \n', math.pi, 'ενώ η δική μας προσέγγιση είναι : \n',my_pi)  